@echo off
mode con cols=90 lines=100 & color fc

rem 獲取管理員權限
:: BatchGotAdmin  
:-------------------------------------  
rem  --> Check for permissions  
>nul 2>&1 "%SYSTEMROOT%\system32\cacls.exe" "%SYSTEMROOT%\system32\config\system"
rem --> If error flag set, we do not have admin.  
if '%errorlevel%' NEQ '0' (  
    echo 獲取管理員權限中,如果UAC彈窗,請選擇允許...
    goto UACPrompt  
) else ( goto gotAdmin )   
:UACPrompt  
    echo Set UAC = CreateObject^("Shell.Application"^) > "%temp%\getadmin.vbs"  
    echo UAC.ShellExecute "%~s0", "", "", "runas", 1 >> "%temp%\getadmin.vbs"   
    "%temp%\getadmin.vbs"
    exit /B  
:gotAdmin  
    if exist "%temp%\getadmin.vbs" ( del "%temp%\getadmin.vbs" )  
    pushd "%CD%"  
    CD /D "%~dp0"

rem 激活部分
cls
:start
echo\
echo                                請輸入數字選擇(請以管理員模式運行):
echo\
echo           ==============================================================================
echo           *                                                                            *
echo           *                        1：激活Windows Server 2019 Standard                 *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        2：激活Windows Server 2019 Datacenter               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        3：激活Windows Server 2019 Essentials               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        4：激活Windows Server 2016 Standard                 *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        5：激活Windows Server 2016 Datacenter               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        6：激活Windows Server 2016 Essentials               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        7：激活Windows Server 2012 R2 Server Standard版     *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        8：激活Windows Server 2012 R2 Datacenter            *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                        9：激活Windows Server 2012 R2 Essentials            *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       10: 激活Windows Server 2012                          *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       11：激活Windows Server 2012 Datacenter               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       12：激活Windows Server 2008 R2 Standard              *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       13：激活Windows Server 2008 R2 Enterprise            *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       14：激活Windows Server 2008 R2 Datacenter            *
echo           *                                                                            *
echo           ==============================================================================
echo           *                                                                            *
echo           *                       15：激活Windows Server 2008  Standard                *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       16：激活Windows Server 2008  Enterprise              *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       17：激活Windows Server 2008 Datacenter               *
echo           *                                                                            *
echo           ==============================================================================
echo           ==============================================================================
echo           *                                                                            *
echo           *                       0：查看 Windows 激活狀態                             *
echo           *                                                                            *
echo           ==============================================================================
set /P var=":"
if %var%==1  goto 1
if %var%==2  goto 2
if %var%==3  goto 3
if %var%==4  goto 4
if %var%==5  goto 5
if %var%==6  goto 6
if %var%==7  goto 7
if %var%==8  goto 8
if %var%==9  goto 9
if %var%==10 goto 10
if %var%==11 goto 11
if %var%==12 goto 12
if %var%==13 goto 13
if %var%==14 goto 14
if %var%==15 goto 15
if %var%==16 goto 16
if %var%==17 goto 17
if %var%==0 goto look


:1
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk N69G4-B89J2-4G8F4-WWYCC-J464C
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit

:2
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk WMDGN-G9PQG-XVVXX-R3X43-63DFG
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit


:3
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk WVDHN-86M7X-466P6-VHXV7-YY726
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit


:4
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk WC2BQ-8NRM3-FDDYY-2BFGV-KHKQY
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit

:5
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk CB7KF-BWN84-R7R2Y-793K2-8XDDG
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit


:6
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk JCKRF-N37P4-C2D82-9YXRT-4M63B
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit


:7
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk D2N9P-3P6X9-2R39C-7RTCD-MDVJX
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:8
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk W3GGN-FT8W3-Y4M27-J84CP-Q3VJ9
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:9
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk KNC87-3J2TX-XB4WP-VCPJV-M4FWM
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:10
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk BN3D2-R7TKB-3YPBD-8DRP2-27GG4
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:11
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk 48HP8-DN98B-MYWDG-T2DCC-8W83P
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:12
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk YC6KT-GKW9T-YTKYR-T4X34-R7VHC
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:13
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk 489J6-VHDMP-X63PK-3K798-CPX3Y
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:14
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk 74YFP-3QFB3-KQT8W-PMXWJ-7M648
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:15
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk TM24T-X9RMF-VWXK6-X8JC9-BFGM2
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:16
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk YQGMW-MPWTJ-34KDK-48M3W-X4Q6V
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit



:17
cls
echo\
echo           ******************************************************************************
echo           *                                                                            *
echo           *     接下來將自動激活,彈窗三次,請點擊每一步彈窗的確定,激活過程需要聯網      *
echo           *                                                                            *
echo           ******************************************************************************
echo\
echo                                         第一步 安裝產品密鑰...
echo\
slmgr -ipk 7M67G-PC374-GR742-YH8V4-TCBY3
echo\
echo                                     第二步 設定認證伺服器...
echo\
slmgr -skms 192.168.0.1
echo\
echo                                         第三步 自動聯網激活...
echo\
slmgr -ato
goto exit


:look
cls
echo\
echo                                          請注意查看彈窗內容
slmgr.vbs -dlv
goto exit


:exit
echo\
echo\
echo\
echo\
echo\
echo\
echo           *******************************指令已經完成***********************************
echo           *                                                                            *
echo           *                                                                            *
echo           *                              按任意鍵退出                                  *
echo           *                                                                            *
echo           *                        http://kwokpcaa.lionfree.net/kms.html               *
echo           *                                                                            *
echo           *******************************By:況天佑*************************************
pause>nul 
start http://kwokpcaa.lionfree.net/kms.html & exit































































































































